![Zip Codes](images/metro-atlanta-zip-codes-map.jpeg)

# Real Estate Investment Project P2: Preprocessing, Modeling, Evaluation

**Author:** Sierra Stanton
***

### Below we'll replicate the initial steps of our exploration notebook to properly load data.

# Step 1: Load the Data/Filtering for Chosen Zipcodes

In [1]:
# import our chosen packages
import pandas as pd
import numpy as np
import pandas.tseries
import matplotlib
import matplotlib.pyplot as plt
import statsmodels.api as sm
import seaborn as sns
import datetime as dt

%matplotlib inline

In [2]:
# import our Zillow dataset
df_z = pd.read_csv('zillow_data.csv')
df_z.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14723 entries, 0 to 14722
Columns: 272 entries, RegionID to 2018-04
dtypes: float64(219), int64(49), object(4)
memory usage: 30.6+ MB

In [3]:
df_z.head()

,RegionID,RegionName,City,State,Metro,CountyName,SizeRank,1996-04,1996-05,1996-06,...,2017-07,2017-08,2017-09,2017-10,2017-11,2017-12,2018-01,2018-02,2018-03,2018-04
0,84654,60657,Chicago,IL,Chicago,Cook,1,334200.0,335400.0,336500.0,...,1005500,1007500,1007800,1009600,1013300,1018700,1024400,1030700,1033800,1030600
1,90668,75070,McKinney,TX,Dallas-Fort Worth,Collin,2,235700.0,236900.0,236700.0,...,308000,310000,312500,314100,315000,316600,318100,319600,321100,321800
2,91982,77494,Katy,TX,Houston,Harris,3,210400.0,212200.0,212200.0,...,321000,320600,320200,320400,320800,321200,321200,323000,326900,329900
3,84616,60614,Chicago,IL,Chicago,Cook,4,498100.0,500900.0,503100.0,...,1289800,1287700,1287400,1291500,1296600,1299000,1302700,1306400,1308500,1307000
4,93144,79936,El Paso,TX,El Paso,El Paso,5,77300.0,77300.0,77300.0,...,119100,119400,120000,120300,120300,120300,120300,120500,121000,121500

## Step 2: Filter data for zipcodes specific to Atlanta

In [4]:
# narrow our zip codes down for relevancy

df_atl = df_z.loc[(df_z['Metro'] == 'Atlanta') & (df_z['City'] == 'Atlanta')] # 12 rows, 272 columns
df_atl

,RegionID,RegionName,City,State,Metro,CountyName,SizeRank,1996-04,1996-05,1996-06,...,2017-07,2017-08,2017-09,2017-10,2017-11,2017-12,2018-01,2018-02,2018-03,2018-04
227,71050,30331,Atlanta,GA,Atlanta,Fulton,228,97100.0,97700.0,98400.0,...,130300,131300,132700,134000,135100,137000,139400,140800,141500,141600
1097,71029,30309,Atlanta,GA,Atlanta,Fulton,1098,260400.0,261700.0,262900.0,...,780200,785900,797400,807600,813500,819200,824900,834500,850300,860700
1223,71043,30324,Atlanta,GA,Atlanta,Fulton,1224,189400.0,190800.0,192300.0,...,506500,509600,515100,519600,523900,528500,532600,537900,543700,545700
1758,71036,30316,Atlanta,GA,Atlanta,Fulton,1759,62300.0,62300.0,62300.0,...,240900,244200,247900,251700,255300,258800,261600,264300,268700,272500
1787,71025,30305,Atlanta,GA,Atlanta,Fulton,1788,297200.0,299000.0,300900.0,...,860000,863400,868200,871200,872400,876800,885600,892900,897600,898200
2757,71028,30308,Atlanta,GA,Atlanta,Fulton,2758,138700.0,139400.0,140100.0,...,524200,529000,539200,547200,557000,570500,581000,585900,594000,599300
3261,71026,30306,Atlanta,GA,Atlanta,Fulton,3262,223100.0,225200.0,227400.0,...,733900,737500,744700,751200,755000,760300,766600,773200,781700,787000
4455,71046,30327,Atlanta,GA,Atlanta,Fulton,4456,515500.0,515900.0,516300.0,...,1135600,1140900,1152100,1158400,1158000,1162000,1173000,1173200,1168400,1165700
4643,71027,30307,Atlanta,GA,Atlanta,Fulton,4644,158900.0,159700.0,160500.0,...,539700,542300,544000,547600,554300,563200,569700,575400,582900,587100
6650,71037,30317,Atlanta,GA,Atlanta,Fulton,6651,51800.0,52500.0,53200.0,...,362500,362500,362300,366000,372400,379200,384900,388400,390400,391600
7641,71045,30326,Atlanta,GA,Atlanta,Fulton,7642,238100.0,240100.0,242100.0,...,582800,575200,569800,565000,564000,566500,567900,574900,587500,594400
10214,71079,30363,Atlanta,GA,Atlanta,Fulton,10215,131400.0,131700.0,132000.0,...,350600,350200,349700,347900,345100,343000,342100,341200,340900,340300

In [5]:
df_atl

,RegionID,RegionName,City,State,Metro,CountyName,SizeRank,1996-04,1996-05,1996-06,...,2017-07,2017-08,2017-09,2017-10,2017-11,2017-12,2018-01,2018-02,2018-03,2018-04
227,71050,30331,Atlanta,GA,Atlanta,Fulton,228,97100.0,97700.0,98400.0,...,130300,131300,132700,134000,135100,137000,139400,140800,141500,141600
1097,71029,30309,Atlanta,GA,Atlanta,Fulton,1098,260400.0,261700.0,262900.0,...,780200,785900,797400,807600,813500,819200,824900,834500,850300,860700
1223,71043,30324,Atlanta,GA,Atlanta,Fulton,1224,189400.0,190800.0,192300.0,...,506500,509600,515100,519600,523900,528500,532600,537900,543700,545700
1758,71036,30316,Atlanta,GA,Atlanta,Fulton,1759,62300.0,62300.0,62300.0,...,240900,244200,247900,251700,255300,258800,261600,264300,268700,272500
1787,71025,30305,Atlanta,GA,Atlanta,Fulton,1788,297200.0,299000.0,300900.0,...,860000,863400,868200,871200,872400,876800,885600,892900,897600,898200
2757,71028,30308,Atlanta,GA,Atlanta,Fulton,2758,138700.0,139400.0,140100.0,...,524200,529000,539200,547200,557000,570500,581000,585900,594000,599300
3261,71026,30306,Atlanta,GA,Atlanta,Fulton,3262,223100.0,225200.0,227400.0,...,733900,737500,744700,751200,755000,760300,766600,773200,781700,787000
4455,71046,30327,Atlanta,GA,Atlanta,Fulton,4456,515500.0,515900.0,516300.0,...,1135600,1140900,1152100,1158400,1158000,1162000,1173000,1173200,1168400,1165700
4643,71027,30307,Atlanta,GA,Atlanta,Fulton,4644,158900.0,159700.0,160500.0,...,539700,542300,544000,547600,554300,563200,569700,575400,582900,587100
6650,71037,30317,Atlanta,GA,Atlanta,Fulton,6651,51800.0,52500.0,53200.0,...,362500,362500,362300,366000,372400,379200,384900,388400,390400,391600
7641,71045,30326,Atlanta,GA,Atlanta,Fulton,7642,238100.0,240100.0,242100.0,...,582800,575200,569800,565000,564000,566500,567900,574900,587500,594400
10214,71079,30363,Atlanta,GA,Atlanta,Fulton,10215,131400.0,131700.0,132000.0,...,350600,350200,349700,347900,345100,343000,342100,341200,340900,340300

In [6]:
# check for missing values
df_atl.isnull().values.any()

False

# Step 3: Data Preprocessing for Modeling

### A. Clean Up Our Dataset
With this dataframe, we'll take the following actions:
1. Drop irrelevant columns and rename key columns
2. Melt our data by transitioning from wide to long format
3. Reset index as needed
4. Convert the column values for datetimes as a pandas series of datetime objects

In [17]:
# create functions to prepare our dataframe

def condense_df(df):
    df_condensed = df.drop(['RegionID', 'City', 'State', 'Metro', 'CountyName', 'SizeRank'], axis=1)
    df_condensed.rename(columns={'RegionName': 'Zipcode'}, inplace=True)
    df_condensed = df_condensed.reset_index(drop=True)
    return df_condensed

def melt_data(df):
    melted = pd.melt(df, id_vars=['Zipcode'], var_name='time')
    melted['time'] = pd.to_datetime(melted['time'], infer_datetime_format=True)
    melted = melted.dropna(subset=['value'])
    return melted

def multi_index_df(df):
    df_full = condense_df(df) # condense our df
    df_full_melt = melt_data(df_full) # melt our df
    ts = df_full_melt.set_index('time')
    df_comprehensive = ts.groupby(['Zipcode']).resample('M').sum()
    df_comprehensive = df_comprehensive.drop('Zipcode', axis=1)
    return df_comprehensive

def get_datetimes(df):
    """
    Takes a dataframe:
    returns only those column names that can be converted into datetime objects 
    as datetime objects.
    NOTE number of returned columns may not match total number of columns in passed dataframe
    """
    
    return pd.to_datetime(df.index, format='%Y-%m')

In [8]:
df_atl2 = multi_index_df(df_atl)
df_atl2.head()

                       value
Zipcode time
30305   1996-04-30  297200.0
        1996-05-31  299000.0
        1996-06-30  300900.0
        1996-07-31  302700.0
        1996-08-31  304500.0

In [9]:
df_atl = df_atl2.reset_index(level=0) # see if we can combine with the function above
df_atl.head()

            Zipcode     value
time
1996-04-30    30305  297200.0
1996-05-31    30305  299000.0
1996-06-30    30305  300900.0
1996-07-31    30305  302700.0
1996-08-31    30305  304500.0

In [10]:
df_atl.rename(columns={'time': 'Date'}, inplace=True)
df_atl.rename(columns={'value': 'Average Price'}, inplace=True)
df_atl.head()

            Zipcode  Average Price
time
1996-04-30    30305       297200.0
1996-05-31    30305       299000.0
1996-06-30    30305       300900.0
1996-07-31    30305       302700.0
1996-08-31    30305       304500.0

In [16]:
get_datetimes(df_atl)

DatetimeIndex(['1996-04-30', '1996-05-31', '1996-06-30', '1996-07-31',
               '1996-08-31', '1996-09-30', '1996-10-31', '1996-11-30',
               '1996-12-31', '1997-01-31',
               ...
               '2017-07-31', '2017-08-31', '2017-09-30', '2017-10-31',
               '2017-11-30', '2017-12-31', '2018-01-31', '2018-02-28',
               '2018-03-31', '2018-04-30'],
              dtype='datetime64[ns]', name='time', length=3180, freq=None)

### Separate according to Zipcode

In [21]:
# create home value dictionary for each zipcode

atl_zipcodes = {}
atl_zipcodes_ls = df_atl.Zipcode.unique() # creates list of the unique zip codes
for zc in atl_zipcodes_ls:  # iterates through zip code list and attachs all values to that zip code 
    ts = (df_atl[df_atl['Zipcode']==zc]['Average Price'].copy())
    ts.name = zc 
    atl_zipcodes[zc] = ts
    
atl_zipcodes[30305]

time
1996-04-30    297200.0
1996-05-31    299000.0
1996-06-30    300900.0
1996-07-31    302700.0
1996-08-31    304500.0
                ...
2017-12-31    876800.0
2018-01-31    885600.0
2018-02-28    892900.0
2018-03-31    897600.0
2018-04-30    898200.0
Name: 30305, Length: 265, dtype: float64

In [22]:
atl_zipcodes_ls

array([30305, 30306, 30307, 30308, 30309, 30316, 30317, 30324, 30326,
       30327, 30331, 30363])

# Step 5: ARIMA Modeling

In [11]:
# train test split, use most recent years as test set
# Slice the timeseries to contain data after 2010-01 - last 15% pf data
# validation data

# Step 6: Interpreting Results